LEXICON: dict[str, str] = {
    "start": "Привет! Добро пожаловать в финансового бота. Здесь вы можете отслеживать считать свои финансы.\n"
    "По желанию, вы можете добавить себе ограничение в бюджете, чтобы отслеживать, сколько вы потратили за месяц.",
    "return": "Вы уже пользуетесь этим ботом.",
    "cancel": "Вы уже находитесь в состоянии выполнения операции.\n"
    "Пожалуйста, следуйте инструкции, или, если хотите прервать выполнение операции,"
    "то введите команду /cancel, или выберите ее из меню",
    "limit_start": "Пожалуйста, введите лимит трат на месяц.\n"
    "Формат ввода: целочисленный <123, 1000, 5555> не более 8-ми знаков",
    "limit_wrong": "Неправильный формат ввода данных. Пожалуйста, еще раз введите ваш лимит в соответствии с форматом.\n"
    "Формат ввода: целочисленный <123, 1000, 5555> не более 8-ми знаков.\n"
    "Если хотите прервать операцию, пожалуйста, введите команду /cancel, или выберите ее"
    "из меню",
    "cancel_without_state": "Вы не находитесь в состоянии выполнения функции или команды. Отмена не нужна",
    "cancel_with_state": "Вы вышли из состояния выполнения функции!",
    "incomes_start": "Пожалуйста, выберите тип дохода",
    "wrong_category": "Ошибка выбора категории. Пожалуйста, выберите категорию из списка.\n"
    "Если хотите прервать операцию, пожалуйста, введите команду /cancel, или выберите ее"
    "из меню",
    "error_wrong_value": "Ошибка: некорректное значение. Пожалуйста, введите целочисленное число или число с запятой не более 8-ми знаков.\n"
    "Если хотите прервать операцию, пожалуйста, введите команду /cancel, или выберите ее"
    "из меню",
    "error_server": "Проихошла ошибка. Пожалуйста, повторите операцию с момента ввода суммы",
    "unknown_message": "Я не поддерживаю данную команду или сообщение. Пожалуйста, выберите те команды, которые представлены в меню.",
    "spending_start": "Пожалуйста, выберите тип расхода",
    "stat_start": "Пожалуйста, выберите период для отображения статистики",
    "stat_period_error": "Ошибка выбора периода. Пожалуйста, выберите период из доступного перечня.\n"
    "Если хотите прервать операцию, пожалуйста, введите команду /cancel, или выберите ее"
    "из меню",
    "reset": "Ошибка: возможно, вы ранее вы решили стереть всю информацию о Вас.\n"
    "Чтобы начать снова пользоваться ботом, пожалуйста, введите команду /start, или выберте ее в меню.",
    "reset_info": "Пожалуйста, подтвердите, хотите ли вы удалить всю информацию о Вас? Внимание, данное действие необратимо,"
    " и вся информация о ваших доходах и расходах за предыдущий период по сегодняшний день будет удалена.",
    "reset_conf": "Вся информация о Вас и ваших доходах удалена. Чтобы снова пользоваться ботом, пожалуйста, введите команду /start или выберите ее в меню.",
    "big_int": "Введено слишком большое число. Пожалуйста, введите число длинной не более 8-ми знаков"
}
